app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "new comment test"], ["post_id", 12], ["created_at", "2020-08-12 11:31:22.566562"], ["updated_at", "2020-08-12 11:31:22.566562"]]
---
  def create
    # @post.commentsに:commentを格納
    @post = Post.find(params[:post_id])
    @post.comments.create(comment_params)