app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order(created_at:'desc')
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def create
    # save
    # @post = Post.new(params[:post]) エラー：値の検証が必要
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "テスト"], ["body", "test"], ["created_at", "2020-08-12 07:49:19.764556"], ["updated_at", "2020-08-12 07:49:19.764556"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "a1238 update"], ["body", " update \r\na54816"], ["updated_at", "2020-08-12 09:38:47.229023"], ["id", 10]]